---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.Contains(Autodesk.Revit.DB.View)
source: html/1da15c1d-4437-bd35-e65f-b69a9fce4577.htm
---
# Autodesk.Revit.DB.ViewSet.Contains Method

Tests for the existence of a view within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	View item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.View`) - The view to be searched for.

## Returns
The Contains method returns True if the view is within the set, otherwise False.